name: "ENSEMBLE-embedding-multilingual-e5-large-instruct"
platform: "ensemble"
max_batch_size: 8
input [
  {
    name: "INPUT_TEXT"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
output [
  {
    name: "last_hidden_state"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "TOKENIZER-multilingual-e5-large-instruct"
      model_version: -1
      input_map {
        key: "INPUT_TEXT"
        value: "INPUT_TEXT"
      }
      output_map [{
        key: "INPUT_IDS"
        value: "input_ids"
      },
        {
            key: "ATTENTION_MASK"
            value: "attention_mask"
        }]
    },
    {
      model_name: "ONNX-embedding-multilingual-e5-large-instruct"
      model_version: -1
      input_map {
        key: "input_ids"
        value: "input_ids"
      }
      input_map {
        key: "attention_mask"
        value: "attention_mask"
      }
      output_map {
        key: "last_hidden_state"
        value: "last_hidden_state"
      }
    }
  ]
}
